using System;
class Program
{
    static void Main()
    {
        int day;

        Console.Write("Введите порядковый номер дня недели (1-7): ");
        day = int.Parse(Console.ReadLine());

        switch (day)
        {
            case 1:
                Console.WriteLine("Понедельник");
                break;
            case 2:
                Console.WriteLine("Вторник");
                break;
            case 3:
                Console.WriteLine("Среда");
                break;
            case 4:
                Console.WriteLine("Четверг");
                break;
            case 5:
                Console.WriteLine("Пятница");
                break;
            case 6:
                Console.WriteLine("Суббота");
                break;
            case 7:
                Console.WriteLine("Воскресенье");
                break;
            default:
                Console.WriteLine("Ошибка: введите число от 1 до 7");
                break;
        }
        Console.ReadKey();
    }
}

//Составить программу (при решении данных задач использовать оператор switch или вложенные операторы if).
// Дан порядковый номер дня недели, вывести на экран его название. 
